Repository: omegat-fi/B333-MateCat
Catalog: MateCat PROJEKTI/tm/unapproved.tmx
Source language: en
Languages: fi

source: The word count is approximate until you click on the Check button.
fi: Sanamäärä on arvioitu kunnes klikkaat Check (Tarkista) -painiketta.

source: When you click on the {1>Check <1}{2>button, MateCat checks each part and divides segments into an indicative number of words, avoiding any overlap between segments.<2}
fi: Klikkaamalla {1>Check (Tarkista)<1}{2> -painiketta, MateCat tarkistaa jokaisen osan ja jakaa segmentit asetetun sanamäärän mukaan välttäen päällekkäisyyttä segmenttien välillä.<2}

source: Page 60
fi: Sivu 60

source: Splitting a job in 4 parts after checking the word count.
fi: Työn jakaminen 4 osaan sanamäärään tarkistamisen jälkeen

source: Note that the word count for each part has changed.
fi: Huomaa, että kunkin osan sanamäärä on muuttunut.

source: {1>When you click on <1}{2>Confirm<2}, you will be presented with a {3>detailed analysis of the split jobs <3}and a {4>Translate <4}button for each part.
fi: {1>Klikattuasi <1}{2>Confirm (Hyväksy)<2}, ohjelmaa näyttää {3>yksityiskohtaisen analyysin jaetuista töistä <3} ja {4>Translate (Käännä)<4} -painikkeen joka osalle.

source: Page 61
fi: Sivu 61

source: A job split in four parts
fi: Neljään osaan jaettu työ

source: In the event that you make a mistake and would like to undo the splitting, just click on the {1>Merge all <1}{2>button and the different parts will be merged back into the original job.<2}
fi: Jos teet virheen ja haluaisit perua jaon, klikkaa {1>Merge all (Yhdistä kaikki)<1}{2> -painiketta ja eri osat yhdistyvät takaisin alkuperäiseen työhön.<2}

source: You just need to send each translator the {1>Job URL<1} for the part they will be working on.
fi: Sinun täytyy vain lähettää joka kääntäjälle {1>työlinkki<1} osalle, jonka parissa heidän tulisi työskennellä.

source: Page 62
fi: Sivu 62

source: When clicking on their link, translators will only see the part of the document assigned to them as editable.
fi: Klikkaamalla kääntäjille tarkoitettua linkkiä, kääntäjät näkevät tiedostosta vain heille muokattavaksi tarkoitetun osan.

source: {1>They can also see the rest of the file, but they will not be able to edit it.<1}
fi: {1>Kääntäjät voivat myös katsoa tiedostoa kokonaisuudessaan, mutta eivät pysty muokkaaman muiden osia.<1}

source: {2>They will see the rest of the document being translated <2}{3>in real time <3}{4>and can refer to the other parts for comparison.<4}
fi: {2>He näkevät muun osan tiedostoa käännettävän<2} {3>reaaliajassa<3}{4> ja voivat käyttää muita osia vertailuun.<4}

source: {1}{2>They will also <2}{3>share a <3}{4>private TM key<4}{5>, if previously associated, where all translations will be stored, so <5}{6>each translator will also receive suggestions for segments already translated by the other translators <6}{7>within the same project.<7}
fi: {1}{2>He myös <2}{3>jakavat<3}{4> yksityisen käännösmuistiavaimen<4}{5>, mikäli sellainen on aiemmin liitetty projektiin, johon kaikki käännökset tallentuvat, joten <5}{6>jokainen kääntäjä saa myös ehdotuksia segmentteihin, joita muut kääntäjät ovat jo kääntäneet <6}{7>saman projektin sisällä.<7}

source: Each translation is complete once {1>all segments <1}{2>of that job have been translated and marked as translated.<2}
fi: Jokainen käännös on valmis kun {1>kaikki työn segmentit <1}{2>on käännetty ja merkattu käännetyksi.<2}

source: {2>The progress bar at the bottom of the screen should be blue and the To-do count should be zero.<2}
fi: {2>Työn edistymispalkin ruudun alareunassa tulisi olla sininen ja tehtävälistan tulisi olla nolla.<2}

source: {1>The <1}{2>progress bar<2}{3>, the <3}{4>To-do count<4}{5> and the <5}{6>payable words<6}{7> count only refer to the current job<7}.
fi: {1><1}{2>Edistymispalkki<2}{3>, <3}{4>tehtävälista<4}{5> ja <5}{6>maksettavien sanojen<6}{7> määrä viittaavat vain tämänhetkiseen työhön<7}.

source: You can check the status and progress of each job from your own {8>Management Panel.<8}
fi: Voit tarkistaa jokaisen työn statuksen ja edistymisen {8>Management (Hallinta) -paneelista<8}.

source: {9>Once all jobs are 100% complete, you can click on any of the links and click on the <9}{10>Download translation <10}button.
fi: {9>Kun kaikki työt ovat 100 prosenttisesti valmiita, voit klikata mitä tahansa linkeistä ja klikata sitten <9}{10>Download translation (Lataa käännös)<10} -painiketta.

source: In this way you will download the {11>whole translated file<11}.
fi: Tällä tavalla lataat {11>käännetyn tiedoston kokonaisuudessaan.<11}

source: Resources for LSPs
fi: Resursseja käännöstoimistoille

source: MateCat can help LSPs (Language Service Providers) to manage projects easily and perform all checks not only after delivery by the translator but also {1>during the translation job <1}itself.
fi: MateCat voi auttaa käännöstoimistoja hallitsemaan projekteja helposti ja tekemään kaikki tarkistukset ei pelkästään käännöstyön jälkeen vaan myös {1>itse työn aikana.<1}

source: The main tools and functions available for Project Managers are the {1>Management<1} {2>Panel,<2} the {3>Editing log<3} and the {4>QA messages<4}{5> in the <5}{6>Translation Editor window<6}.
fi: Pääasialliset työkalut ja toiminnot saatavilla projektipäälliköille ovat {1>Management (Hallinta)<1}{2> -paneeli,<2} {3>Editing log (Editointiloki)<3} ja {4>QA-viestit<4} {5><5}{6>Translation Editor (Käännöseditori) -ikkunassa.<6}

source: Page 63
fi: Sivu 63

source: Through the Management Panel, the Project Manager can easily check {1>the status <1}{2>of all translation jobs in <2}{3>real time<3}.
fi: Management (Hallinta) -paneelin kautta projektipäällikkö voi helposti tarkistaa {2>kaikkien käännöstöiden<2} {1>statuksen<1} {3>reaaliajassa<3}.

source: Here, he/she has a list of all active projects in chronological order and the progress bar for each job.
fi: Tätä kautta hänellä on lista kaikista aktiivisista projekteista aikajärjestyksessä ja hän näkee myös edistymispalkin jokaiselle työlle.

source: {1>By clicking on the job URL of a specific project, it is possible to <1}{2>check errors during the translation <2}and promptly advise the translator working on the project.
fi: {1>Klikkaamalla linkkiä tietylle projektille projektipäällikön on mahdollista <1}{2>tarkistaa virheitä käännöstyön aikana <2} ja ohjeistaa projektin parissa työskentelevää kääntäjää viiveettä.

source: Through the QA module, it is possible to check if there are {3>tag errors or translation conflicts <3}during the translation, without waiting for delivery by the translator and thus save time.
fi: QA-moduulin kautta on mahdollista tarkistaa {3>tunnistevirheet (tag error) ja kilpailevat käännökset (translation conflicts)<3} käännöksen aikana joutumatta odottamaan työn lopullista palautusta ja säästen aikaa.

source: Page 64
fi: Sivu 64

source: From the Translation Editor window, it is possible to access the Editing Log page by clicking on the {1>Editing Log <1}button at the bottom of the page.
fi: Translation Editor (Käännöseditori) -ikkunasta on mahdollista päästä käsiksi Editing log (Editointiloki) -sivulle klikkaamalla {1>Editing Log<1}-painiketta sivun alaosassa.

source: {1>In the Editing Log, the Project Manager can check the <1}{2>time <2}spent by the translator for editing each segment, the total time spent by the translator to translate the entire file and check the {3>edits <3}made to suggestions.
fi: {1>Editointilogissa projektipäällikkö voi tarkistaa <1} kääntäjän käyttämän segmentti- ja tiedostokohtaisen {2>ajan<2} sekä tarkistaa ehdotuksiin tehdyt {3>muutokset<3}.

source: The changes are highlighted with track changes.
fi: Muutoksen näkyvät muokkausmerkinnöissä.

source: This can help the Project Manager identify the Post-Editing efforts of the translator to edit the segments.
fi: Tämä voi auttaa projektipäällikköä tunnistamaan kääntäjien segmenttien jälkieditointiin käytetyn ajan.

source: Appendix
fi: Liitteet

source: Keyboard Shortcuts
fi: Pikanäppäimet

source: MateCat relies heavily on {1>keyboard shortcuts <1}for standard and advanced functionalities.
fi: MateCat tukee laajasti {1>pikanäppäimiä<1} usein käytetyissä ja monimutkaisimmissa toiminnoissa

source: Getting to know the shortcuts below will help you be more productive when translating in MateCat.
fi: Oheisiin näppäinyhdistelmiin tutustuminen auttaa sinua kääntämään produktiivisemmin MateCatilla.

source: Confirm translation (click on Translated)
fi: Vahvista käännös (klikkaa Translated)

source: Confirm translation and go to next untranslated segment (click on [T+>>])
fi: Vahvista käännös ja siirry seuraavaan kääntämättä olevaan segmenttiin (klikkaa [T + >>])

source: CTRL+SHIFT+Enter
fi: CTRL + VAIHTO + Enter

source: CMD+SHIFT+Enter
fi: CMD + VAIHTO + Enter

source: Go to next segment
fi: Siirry seuraavaan segmenttiin

source: CTRL+Down
fi: CTRL + Alanuoli

source: Page 65
fi: Sivu 65

source: Return to previous segment
fi: Palaa aiempaan segmenttiin

source: CTRL+Up
fi: CTRL + Ylänuoli

source: Go to current segment
fi: Siirry nykyisen segmenttiin

source: CMD+SHIFT+up
fi: CMD + VAIHTO + Ylänuoli

source: Copy source to target
fi: Kopioi lähde kohteeseen

source: Undo in segment (available in active segment)
fi: Kumoa segmentissä (saatavilla aktiivisessa segmentissä)

source: Redo in segment (available in active segment)
fi: Tee uudelleen segmentissä (saatavilla aktiivisessa segmentissä)

source: CMD+SHIFT+z
fi: CMD + VAIHTO + z

source: Go to beginning of the line
fi: Siirry rivin alkuun

source: CMD+left
fi: CMD + Nuoli vasemmalle

source: Go to end of the line
fi: Siirry rivin loppuun

source: CMD+right
fi: CMD + Nuoli oikealle

source: Move the cursor word by word to the right
fi: Siirrä kohdistinta sana kerrallaan oikealle

source: CTRL+right
fi: CTRL + Nuoli oikealle

source: ALT+right
fi: ALT + Nuoli oikealle

source: Move the cursor word by word to the left
fi: Siirrä kohdistinta sana kerrallaan vasemmalle

source: CTRL+left
fi: CTRL + Nuoli vasemmalle

source: ALT+left
fi: ALT + Nuoli vasemmalle

source: Open search (if not yet opened)
fi: Avaa haku (jos ei vielä avoinna)

source: Page 66
fi: Sivu 66

source: Perform Concordance search on word(s) selected in the source or target segment
fi: Suorita Vastaavuushaku lähde- tai kohdesegmentissä valittuihin sanoihin

source: Use Translation suggestions (first/second/third suggestion)
fi: Käytä käännösehdotuksia (ensimmäinen/toinen/kolmas ehdotus)

source: Add a new line in the target segment
fi: Lisää uusi rivi kohdesegmenttiin

source: SHIFT+Enter
fi: VAIHTO + ENTER

source: Add a non-breaking space
fi: Lisää sitova välilyönti

source: CTRL+Shift+Space
fi: CTRL + VAIHTO + Välilyönti

source: Page 67
fi: Sivu 67

source: Installing an open source version of MateCat
fi: Avoimen lähdekoodin MateCat-version asentaminen

source: We provide a guide meant for users who want to install and administer the open source version on their own machines.
fi: Tarjoamme oppaan, joka on suunnattu niille, jotka haluavat asentaa ja hallita avoimen lähdekoodin versiota omilla päätteillänsä.

source: {1>It is available at <1}{2>{3>www.matecat.com/installation-guide<3}{4>.<4}<2}
fi: {1>Se on saatavilla osoitteessa <1}{2>{3>www.matecat.com/installation-guide<3}{4>.<4}<2}

source: Page 68
fi: Sivu 68

source: {b>Post-editing and outsourcing made easy<b}
fi: {b>Post-editointi ja ulkoistaminen tehty helpoksi<b}

source: {1}{b>User manual and installation guide<b}
fi: {1}Käyttöopas ja asennus

source: {3>4 <3}How MateCat Calculates Payable Words.......................................................................................4 Volume Analysis Pag{4>e<4}............................................................................................................................5 Supported browser, languages and formats................................................................................6 Translation Process.................................................................................................................................9 {5>Start working with MateCat ................................................................................................11 <5}MateCat Home Page and Logi{6>n<6}.......................................................................................................11 Creating Projects ...................................................................................................................................11 How To Upload File(s) for Translatio{7>n<7}.......................................................................................12 Translation Memory and Machine Translation.......................................................................14 Machine Translation Servers...........................................................................................................15 Analysis Repor{8>t<8}......................................................................................................................................16 Public Translation Memory and Translation Memory Ke{9>y<9}...............................................20 TM backup and update{10>s<10}.....................................................................................................................21 How to add a Glossary.........................................................................................................................22 Translation Editor User Interface..................................................................................................23
fi: {3>4 <3} Miten MateCat laskee maksettavat sanat... 4 Volume analysis (Volyymianalyysi) siv{4>u<4}... 5 Tuettu selain, kielet ja formaatit... 6 Käännösprosessi... 9 {5>Aloita käyttämään MateCatia... 11 <5}MateCatin Etusivu ja sisäänkirjautumine{6>n<6}... 11 Projektien luonti... 11 Miten ladata tiedostoja käännettäväks{7>i<7}... 12 Käännösmuisti ja Konekääntäminen... 14 Konekäännöspalvelimet... 15 Analyysiraportt{8>i<8}... 16 Julkinen käännösmuisti ja käännösmuistiavai{9>n<9}... 20 Konekäännöksen varmuuskopiointi ja päivitykse{10>t<10}... 21 Sanaston lisääminen... 22 Käännöseditorin käyttöliittymä... 23

source: Top ba{1>r<1}...........................................................................................................................................24 o
fi: Yläpalkk{1>i<1}

source: Editor windo{2>w<2}............................................................................................................................26 o
fi: Editori-ikkun{2>a<2}

source: Bottom bar....................................................................................................................................28
fi: Alapalkki

source: Page 2
fi: Sivu 2

source: Page 3
fi: Sivu 3

source: Introducing MateCat
fi: Esittelyssä MateCat

source: MateCat is an open source, enterprise-level, web-based translation software which closely integrates machine translation and human translation.
fi: MateCat on avoimen lähdekoodin yritys-tason web-pohjainen käännösohjelma, joka integroi kone- ja ihmiskäännökset läheisesti toisiinsa.

source: Using MateCat, you obtain between 10% and 20% more matches for your translations thanks to the largest public translation memory in the world and the best machine translation currently in use.
fi: MateCatia hyödyntämällä saat 10-20% enemmän osumia käännöksiisi suurimman julkisen käännösmuistin ja maailman parhaimman käytössä olevan konekääntäjän ansiosta.

source: How MateCat Calculates Payable Words
fi: Miten MateCat laskee maksettavat sanat

source: MateCat counts words by using a {1>combination <1}{2>of advanced <2}{3>TM technology <3}(MyMemory) and application of a reduction in weighting {4>for machine translation suggestions<4}.
fi: MateCat-ohjelmiston sanojen laskeminen toteutetaan {1>yhdistämällä<1} {2>kehittynyttä<2} {3>käännösmuistiteknologiaa<3} (MyMemory) ja painotetun sanamäärän vähentämisen soveltamista {4>konekäännöksen käännösehdotusten<4} kanssa.

source: This allows MateCat to give you {5>more matches <5}{6>than any other translation tool.<6}
fi: Näin MateCat pystyy antamaan sinulle {5>enemmän osumia<5} {6>kuin mikään muu käännöstyökalu.<6}

source: According to industry standards, words or phrases with a 100% Translation Memory match are given a weighting of 30% and words or phrases with a partial TM match are given a weighting of 60%.
fi: Alan standardien mukaan, sanoja tai lauseita, joilla on 100 %:n osuma käännösmuistissa lasketaan olevan 30 % painotus sanasta. Sanoja tai lauseita, joilla on osittainen osuma käännösmuistissa ovat 60 % painotus sanasta tai lauseesta.

source: Here is an example to calculate weighted words{1>1<1}{2>:<2}
fi: Tässä on esimerkki siitä, kuinka laskea painotettuja sanoja{1>1<1}{2>:<2}

source: No TM match = Lower fuzzy ranges = Higher fuzzy ranges = 100% match =
fi: Ei osumia käännösmuistissa = pienemmät osittaisten osumien vaihteluvälit = suuremmat osittaisten osumien vaihteluvälit = 100 %:n osuma

source: Repetition (same segment repeated in the document) = Context match (more than 100% match, because of same context information in the TM) =
fi: Toisto (asiakirjassa toistuva sama segmentti) = kontekstiosuma (yli 100 %:n osuma, koska samasta tekstiyhteydestä löytyy tietoa käännösmuistista) =

source: 50 and 70% 40%
fi: 50 ja 70 % 40 %

source: {1>Each CAT tool counts words differently and each LSP calculates weighted words differently.<1}
fi: {1>Jokainen CAT-työkalu laskee sanat eri tavalla ja jokainen käännöstoimisto painotetut sanat eri tavalla.<1}

source: Page 4
fi: Sivu 4

source: MateCat counts matches according to these standards.
fi: MateCat laskee osumia näiden standardien mukaan.

source: For Machine Translation, MateCat decides which reduction in weighting to apply on the basis of the extent to which the {1>MT <1}has been useful for the past 1 million words for each language combination.
fi: Konekääntämisessä MateCat päättää, kuinka suurta painotusta sovelletaan perustuen siihen, kuinka hyödyllinen {1>konekääntäminen<1} on ollut viimeisen miljoonan sanan kanssa jokaisen kieliparin välillä.

source: MateCat assumes that the less the machine translation suggestion is edited by translators, the more useful it is.
fi: MateCat olettaa, että mitä vähemmän konekäännösehdotusta editoidaan ihmiskääntäjän puolesta, sitä hyödyllisempi se on.

source: We decided to {1>split the benefits of this technology <1}{2>between the language service provider and the translator.<2}
fi: Päätimme {1>jakaa kyseisen teknologian hyödyt<1} {2>käännöstoimiston ja kääntäjän välillä.<2}

source: {2>So, if a translator saves 20% of his/her time, the word count is reduced by 10% only.<2}
fi: {2>Eli jos kääntäjä säästää 20 % ajastaan, sanamäärää vähennetään vain 10 %:lla.<2}

source: {1>How MateCat counts <1}{2>payable words <2}in a project is indicated in the volume analysis {3>report<3} generated during {4>creation of the project<4} itself.
fi: {1>Se, miten MateCat laskee<1} {2>maksettavat sanat<2} projektissa, on ilmoitettu {3>volyymianalyysiraportissa<3}, joka luodaan automaattisesti {4>projektin luonnin<4} yhteydessä.

source: Volume Analysis Page
fi: Volyymianalyysisivu

source: The volume analysis page which opens during the creation of a project in MateCat shows you a global {1>report <1}{2>of the volume <2}to be translated:
fi: Volyymianalyysisivu, joka avautuu MateCatissa projektin luonnin yhteydessä, näyttää {1>kokonaisraportin<1} käännettävästä {2>tekstimäärästä<2}:

source: The volume as calculated by {2>industry standard CAT tools.<2}
fi: {2>Käännösalan standardien mukaisten CAT-työkalujen<2} mukaan laskettu sanamäärä.

source: Calculation of the weighted word count takes into consideration repetitions and TM matches.
fi: Painotetun sanamäärän laskelma ottaa huomioon toistot ja käännösmuistiosumat.

source: The {2>MateCat word count<2} which not only counts repetitions and TM matches, but also generates reductions in weightings for internal matches and MT suggestions.
fi: {2>MateCatin laskema sanamäärä<2}, joka ei paitsi ota huomioon toistoja ja käännösmuistiosumia, vaan myös luo vähennyksiä sanamäärän painotukseen sisäisten osumien ja käännösmuistiehdotusten mukaan.

source: The word count without any reduction in weighting for repetitions or matches.
fi: Sanamäärä ilman mitään vähennyksiä painotuksessa toistoista tai osumista.

source: For each language pair, you will find the details of the analysis.
fi: Löydät analyysin lisätiedot jokaiselle kieliparille.

source: Page 5
fi: Sivu 5

source: {1}{2>In case of <2}{3>multiple language pairs<3}{4>, this global report shows you the total project volume.<4}
fi: {1}{2><2}{3>Useiden kieliparien<3} {4>tapauksessa, tämä kokonaisraportti näyttää projektin kokonaiskäännösmäärän.<4}

source: Supported browser, languages and formats
fi: Tuetut selaimet, kielet ja tiedostomuodot

source: All you need to use to start working with MateCat is an up-to-date version of a supported web browser:
fi: Aloittaaksesi työskentelyn MateCatin avulla tarvitset vain ajantasaisen version tuetusta Internet-selaimesta:

source: • {1>Google Chrome <1}{2>30, or higher (on Windows, Linux and Mac OS X) <2}• {3>Safari <3}{4>5.1.7, or higher (on Mac OS X)<4}
fi: • {1>Google Chrome <1}{2>30 tai uudempi (Windows, Linux ja Mac OS X) <2}• {3>Safari <3}{4>5.1.7, tai uudempi (Mac OS X)<4}

source: Page 6
fi: Sivu 6

source: MateCat supports {1>79 languages, <1}works with many language combinations, and supports {2>56 file formats<2}.
fi: MateCat tukee {1>79 kieltä<1}, {2>56 eri tiedostomuotoa<2} ja toimii monien kieliyhdistelmien kanssa.

source: Here is the list of supported languages and file formats:
fi: Tässä on lista tuetuista kielistä ja tiedostomuodoista:

source: Supported languages
fi: Tuetut kielet

source: Page 7
fi: Sivu 7

source: Supported file formats
fi: Tuetut tiedostoformaatit

source: Page 8
fi: Sivu 8

source: Translation Process
fi: Käännösprosessi

source: The translation process is divided into the following phases:
fi: Käännösprosessi on jaettu seuraaviin vaiheisiin:

source: {1>Creating a project<1}: from the MateCat home page {2>{3>(<3}{4>http://www.matecat.com)<4}<2} you can select the {5>source and target language(s) <5}and add the file(s) to translate.
fi: {1>Projektin luonti<1}: voit valita MateCatin kotisivulta {2>{3>(<3}{4>http://www.matecat.com)<4}<2} {5>lähde- ja kohdekielet<5} ja lisätä käännettävät tiedostot.

source: Then you can choose one of the following options:
fi: Sitten voit valita seuraavista vaihtoehdoista:

source: {1>o<1}use a {2>machine translation server<2}{3> of your choice.<3}
fi: {1>o<1}käytä haluamaasi {2>konekäännöspalvelinta<2}{3><3}

source: {3>This option allows you to receive <3}{4>machine translation suggestions <4}for each segment from the server you choose.
fi: {3>Tämä valinta antaa sinulle mahdollisuuden saada<3} {4>konekäännösehdotuksia<4} jokaiselle segmentille valitsemaltasi palvelimelta.

source: You can disable this option by selecting {5>NONE <5}{6>from the dropdown menu.<6}
fi: Voit poistaa tämän valinnan käytöstä valitsemalla {5>NONE<5} {6>-vaihtoehdon pudotusvalikosta.<6}

source: o associate an existing or new {1>private TM<1}.
fi: o liitä olemassa oleva tai uusi {1>yksityinen käännösmuisti<1}.

source: By associating a private TM, you will be able to store all the translated segments in this private translation memory and {2>add new glossary items<2}{3> if necessary.<3}
fi: Liittämällä yksityisen käännösmuistin voit säilyttää kaikki käännetyt segmentit tässä käännösmuistissa ja {3> tarvittaessa<3} {2>lisätä sanalistaan uusia termejä<2}.

source: {3>In this way, you will be able use this private TM for future projects and take advantage of already translated segments.<3}
fi: {3>Tällä tavalla voit käyttää tätä yksityistä käännösmuistia tulevissa projekteissa ja hyödyntää jo käännettyjä segmenttejä.<3}
